{
  "architectures": [
    "StudentForCausalLM"
  ],
  "bos_token_id": 1,
  "dropout_prob": 0.1,
  "eos_token_id": 2,
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "max_position_embeddings": 1024,
  "model_type": "student_2simplex",
  "num_attention_heads": 8,
  "num_heads": 8,
  "num_hidden_layers": 6,
  "num_layers": 8,
  "pad_token_id": 0,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "use_simplex_attention": false,
  "use_triton": true,
  "vocab_size": 757,
  "w1": 8,
  "w2": 8
}
